[
	{
		"id": "5fa4d5b1b44e1d05840c190e",
		"title": "Making a spider 🕷",
		"slug": "making-a-spider",
		"html": "<p>Not an arachnid, a web crawler (otherwise known as a spider). Spiders are the sole reason why everything is so accessible on the internet. Spiders look at websites, scan for links, opens those links, scans for more links, etc. It stores all this data in to a database and then makes it accessible to you. Google gets all of its data from its own spider called <a href=\"https://support.google.com/webmasters/answer/182072?hl=en\">Googlebot</a>. It might sound complicated but it's surprisingly easy. Thanks to a Python framework called <a href=\"https://scrapy.org/\">Scrapy</a>, it takes only a few lines of code to scrape information off of a website and keep on crawling.</p><p>To start off, you'll have to install Scrapy using with PyPi with the following command: <code>pip install scrapy</code>. Then, create a new Scrapy project with <code>scrapy createproject coolspider</code>. After the project is made, go to <code>coolspider/coolspider/spiders/</code> and make a new Python file called <code>coolspider.py</code>. It should look like this:</p><pre><code class=\"language-python\">import scrapy\n\nclass CoolSpider(scrapy.Spider):\n    name = 'coolspider'\n    allowed_domains = ['ismaeelakram.com']\n    start_urls = ['https://ismaeelakram.com/']\n    \n    def parse(self, response):\n        print(response.body)</code></pre><p>This is the simplest spider. All it does is it takes URLs out of the list and prints out their bodies. To run it, run <code>scrapy crawl coolspider</code>. You can replace <code>coolspider</code> with the name of the Python file in the spiders folder. If you run this, you'll notice that it only prints the body of one page; it doesn't crawl. To make it crawl, we have to look for links in the response body and then scan those ones. You can accomplish this by adding:</p><pre><code class=\"language-python\">import scrapy\n\n\nclass CoolSpider(scrapy.Spider):\n    name = 'coolspider'\n    allowed_domains = ['ismaeelakram.com']\n    start_urls = ['https://ismaeelakram.com/']\n\n    def parse(self, response):\n        with open('urls.txt', 'a') as f:\n            f.write(f\"{response.url}\\n\")\n        for href in response.css('a::attr(href)'):\n            yield response.follow(href, callback=self.parse)\n</code></pre><p>With this new code, it begins at <code>https://ismaeelakram.com/</code>, and it writes down the URL in a text file called <code>urls.txt</code>. Then, for every link on that page, it continues the same pattern. If you run this now, you'll see that it might take longer but the text file will be created. The contents of my <code>urls.txt</code> goes like this:</p><pre><code>https://ismaeelakram.com/\nhttps://ismaeelakram.com/will-crypto-currencies-take-over-the-world/\nhttps://ismaeelakram.com/walmarts-robot-rage/\nhttps://ismaeelakram.com/the-man-unbroken-by-solitary/\nhttps://ismaeelakram.com/intels-fear-of-missing-out/\nhttps://ismaeelakram.com/bigger-upwards-not-outwards/\nhttps://ismaeelakram.com/why-i-like-to-host-my-website-on-aws-servers/\nhttps://ismaeelakram.com/\nhttps://ismaeelakram.com/about/\nhttps://ismaeelakram.com/august-view-smart-doorbell/\nhttps://ismaeelakram.com/the-corbyn-question/\nhttps://ismaeelakram.com/how-creepy-is-your-smart-speaker/\nhttps://ismaeelakram.com/googles-flutter-and-dart/</code></pre><p>The crawler is a success! Now, instead of writing the URL to <code>urls.txt</code>, you can do anything with the information on the page. For example, you can add it to a database, look for keywords, and more. You can also try to crawl bigger and more comprehensive websites. The limits are endless with Scrapy and you should try making everything you can.</p>",
		"feature_image": "https://images.unsplash.com/photo-1580106815433-a5b1d1d53d85?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": true,
		"visibility": "public",
		"created_at": "2020-10-09T21:16:07.000-04:00",
		"updated_at": "2020-11-05T23:36:51.000-05:00",
		"published_at": "2020-10-10T12:18:35.000-04:00",
		"custom_excerpt": "Spiders are the sole reason why everything is so accessible on the internet. Here's how to easily make one.",
		"excerpt": "Spiders are the sole reason why everything is so accessible on the internet. Here's how to easily make one.",
		"reading_time": 2
	},
	{
		"id": "5fa4d5b1b44e1d05840c190a",
		"title": "Why I like to host my website on AWS servers 💻",
		"slug": "why-i-like-to-host-my-website-on-aws-servers",
		"html": "<p>For about 3-4 years, I had been hosting my website on GoDaddy's servers. Although it was simple for normal users, I felt like I had outgrown the <em>\"all managed for you\" </em>part. As I run my own personal servers, I thought I can take full advantage of my website by managing the hosting myself with the help of AWS. <strong>Here are some reasons why I like hosting with AWS:</strong></p><h2 id=\"control\">Control</h2><p>With GoDaddy hosting, your control is through an interface called cPanel. Although cPanel gives you many options, it is still not the same as command-line control. With AWS, you get 100% control through console. I have so much control that I can make the fans of the server in North Virginia go faster and slower.</p><h2 id=\"cloudflare\">Cloudflare</h2><p><a href=\"https://cloudflare.com\">Cloudflare</a> helps bring your site load times down and bring your security up. Many of the world's biggest websites use Cloudflare to prevent attacks and to make their users' experience more seamless. Cloudflare is something I definitely needed for my website. However, if you wanted to use Cloudflare, you would have to sacrifice cPanel because for some odd reason, GoDaddy's version of cPanel does not support Cloudflare. When this decision came up, I chose to sacrifice cPanel because I was fine with command-line access. But GoDaddy had struck me with its limitations again because I do not get command-line access, which left me with no control over my website. Once I switched back to GoDaddy's nameservers however, everything magically worked again. Now that I use AWS servers, I am able to use Cloudflare.</p><h2 id=\"speed\">Speed</h2><p>The website you are reading this post on is much faster than before. Even though you can get a very fast website with GoDaddy, the only way to match AWS' speeds would be to pay GoDaddy $60 a month while AWS costs $8 a month for more reliable, faster servers where you get full control. As I mentioned earlier, AWS allows me to use Cloudflare. Cloudflare makes my website load 50% faster than its already <em>very fast</em> speeds.</p><h2 id=\"price\">Price</h2><p>AWS is the best top-tier server platform and it still has the best price. You only pay for what you use. If this blog ever boosted because of one article, the bill would go higher. However, if I am not active on my website and nobody touches it, the bill would drop. I am a big fan of this system because of how fair it is. If the bill went higher it would not have been their fault, it would have been the product of success.</p>",
		"feature_image": "https://images.unsplash.com/photo-1571786256017-aee7a0c009b6?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-31T19:18:33.000-04:00",
		"updated_at": "2021-01-20T23:32:30.000-05:00",
		"published_at": "2020-03-31T20:52:27.000-04:00",
		"custom_excerpt": "If you are looking to upgrade your website but not spend more money, AWS is the way to go. Here's why.",
		"excerpt": "If you are looking to upgrade your website but not spend more money, AWS is the way to go. Here's why.",
		"reading_time": 2
	},
	{
		"id": "5fa4d5b1b44e1d05840c1909",
		"title": "Google's Flutter and Dart 🎯",
		"slug": "googles-flutter-and-dart",
		"html": "<p>Companies do not like to spend a lot of money on their mobile apps because of the separation of Apple software and Android software. There has to be a separate team for each platform. However, <a href=\"https://ismaeelakram.com/p/ad52c334-4f18-42e5-9503-e226e863b5c5/reactnative.dev\">React Native</a> solved this problem for the world's best companies. They could hire web developers to make mobile apps with JavaScript and web-like code. However, React Native is made and run by Facebook, one of Google's top competitors. </p><p>Google would not like to be left behind but it would also not like to conform to other companies and rely on Facebook for their stability. Google solved this conundrum by creating their own framework like React Native called <a href=\"https://flutter.dev\">Flutter</a>. Flutter uses a Google-like design called <a href=\"https://material.io\">Material</a> and also uses another programming language called <a href=\"https://dart.dev\">Dart</a>. </p><p>As per usual, Google has made switched all of its apps to Flutter. This is why <em>you know</em> when an app is made by Google. Material Design is Google's look and everyone thinks of Google when they see it. </p><p>Dart is based on Java, Swift, JavaScript, making it very easy to learn for most developers. The syntax is a mixture of the best parts of each language. However, this does not make it better than any of these languages. Dart is designed for Flutter which means that nobody will be using it for anything else.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://cdn.ismaeelakram.com/2020/11/j6gtbhhboqq41.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1680\" height=\"634\"><figcaption>This is an example of Dart code.</figcaption></figure><p>Although most apps use React Native, many great apps are coming from Flutter too and they all look great. Many Flutter apps have turned out great and they look amazing because of the CSS/SASS integration.</p>",
		"feature_image": "https://images.unsplash.com/photo-1534945644675-24836fd2906c?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T20:33:58.000-04:00",
		"updated_at": "2020-11-04T20:38:28.000-05:00",
		"published_at": "2020-03-30T21:30:55.000-04:00",
		"custom_excerpt": "Google released their new React Native alternative called Flutter and with Flutter comes their new programming language, Dart.",
		"excerpt": "Google released their new React Native alternative called Flutter and with Flutter comes their new programming language, Dart.",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1908",
		"title": "Walmart's robot rage",
		"slug": "walmarts-robot-rage",
		"html": "<p>Walmart is planning on implementing a revolutionary change to the way people grab their goods. It wants to acquire robots to help gather items, fill orders, and even carry things to a customer called the Alphabot system. Robots on wheels carrying baskets bag the items for pickup or send them to the delivery section.</p><p>I believe that this is a good addition to stores only if it is implemented right. If the robots are not made properly with time and effort, they will fail at their tasks and actually make things worse at Walmart. People would not receive their packages on time and even people in stores will be waiting for long periods of time only to hear their order got delayed because of the new things Walmart is trying out.</p><p>However, this change will not be as great as it sounds for Walmart employees. They would be losing their jobs and if Walmart is deploying more robots, so would other companies. If more companies added robots, countless others would lose their jobs. According to the Wall Street Journal, \"A store worker can collect around 80 products from store shelves an hour. Alphabot is designed to collect 800 products an hour per workstation, operated by a single individual.\" If this is done right, it can change the lives of many people around the world.</p>",
		"feature_image": "https://images.unsplash.com/photo-1485827404703-89b55fcc595e?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T17:16:35.000-04:00",
		"updated_at": "2020-03-30T17:17:27.000-04:00",
		"published_at": "2020-01-11T17:17:00.000-05:00",
		"custom_excerpt": "Walmart is planning on implementing a revolutionary change to the way people grab their goods. It wants to acquire robots to help gather items, fill orders, and even carry things to a customer.",
		"excerpt": "Walmart is planning on implementing a revolutionary change to the way people grab their goods. It wants to acquire robots to help gather items, fill orders, and even carry things to a customer.",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1907",
		"title": "Intel's fear of missing out",
		"slug": "intels-fear-of-missing-out",
		"html": "<p>Intel has always primarily been a company specializing in processors but it is now diversifying. Recently, Intel released a prototype of its new GPU. Quite a bit earlier, Bob Swan, the CEO of Intel said that matching an NVIDIA GPU is “non-negotiable”.</p><p>I think that Intel should indeed diversify and make other types of technology. They would be great at efficiently using as much power in the smallest packages. If Intel began making GPUs or RAM, they would certainly earn more money.</p><p>They missed out on the opportunity for smartphones and that is one of their biggest regrets. The <em>delay, miss</em> in the smartphone market allowed Samsung and the Taiwan Semiconductor Manufacturing Company to catch up to Intel. However, they can still make more money by expanding their market. One possible idea is for Intel to start making PCs. Intel already is a household name because of the sticker on almost everyone’s computer. If they made computers, they would automatically be trusted by people who might not even know what Intel is.</p><p>Mr. Swan wants to be the first in history to successfully <em>marry ambition with discipline</em>. You see this with many YouTubers. They aim to become popular but have to sell their dignity to do so.</p><p>Gordon Moore, the founder of Intel, observed that every 2 years, the capabilities of processors would double. However, Moore’s Law seems to be fading. The idea of shrinking processors is slowing down. Processors have already gotten so small. If they keep shrinking, you might as well be holding one pin on the processor!</p><p>Intel has invested in almost everything ever created. If they have even the slightest glimpse of something new, they’ll buy it. Some of the things it bought is Altera (which makes reconfigurable server chips) and Mobileye (which gives self-driving cars sight).</p><p>To conclude, Intel has missed out on many opportunities. Despite the fact that it is a very successful company, it is short-eyed. It tends to look straight forward and not view anything not there. Intel looked directly at CPUs for computers and not for anything else such as the rising smartphone. They’ve surely realized they made these mistakes and are definitely not making it again.</p>",
		"feature_image": "https://images.unsplash.com/photo-1540829917886-91ab031b1764?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T17:12:42.000-04:00",
		"updated_at": "2020-03-30T17:17:47.000-04:00",
		"published_at": "2019-10-21T17:15:00.000-04:00",
		"custom_excerpt": "Intel has always primarily been a company specializing in processors but it is now diversifying. Recently, Intel released a prototype of its new GPU. Let's see if it's any good.",
		"excerpt": "Intel has always primarily been a company specializing in processors but it is now diversifying. Recently, Intel released a prototype of its new GPU. Let's see if it's any good.",
		"reading_time": 2
	},
	{
		"id": "5fa4d5b1b44e1d05840c1905",
		"title": "Will crypto-currencies take over the world?",
		"slug": "will-crypto-currencies-take-over-the-world",
		"html": "<p>We all know about Bitcoin and how it is taking the world by storm. You may not know that Bitcoin is not the only cryptocurrency and there are <strong>many </strong>others. The Wall Street Journal recently made its own cryptocurrency called WSJCoin.</p><p>Steven Russolillo, an author for the Wall Street Journal, was very interested in why Bitcoin had become so successful. He finally came to the conclusion that the best way to learn about cryptocurrency was by creating one. Because you cannot just create a cryptocurrency with no prior knowledge, he took information from other cryptocurrencies. To do this, he travelled to the land of cryptocurrency, Japan. One of the cryptocurrencies he learned from was Bitcoin.</p><p>The goal and point of Bitcoin is for people to perform online transactions in the most secure and safe way. Bitcoin is, basically, an online transaction service with no man in the middle. Just the sender and the receiver. But if it’s online, some kind of bot has to verify if the sender has enough money to make the transaction. Well, this is where the block chain comes in. The block chain is, according to Bitcoin, a “shared public ledger on which the entire Bitcoin network relies.” This means that the block chain verifies the transactions. This is how they accomplish the goal in which there is no middle man. However, another one of their goals is “fast,” and if one server is handling all of these transaction requests at one time, it will most likely not be smooth at all and the servers may crash from time to time. They achieve this by spreading the block chain into parts. Remember that the block chain is a <strong>shared</strong> public ledger, and it is called the block <strong>chain</strong>. A chain is metal pieces connected into one long chain. These metal pieces are shared throughout the world.</p>",
		"feature_image": "https://images.unsplash.com/flagged/photo-1554386690-ddcab0b98d1d?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T17:03:45.000-04:00",
		"updated_at": "2020-03-30T17:04:40.000-04:00",
		"published_at": "2019-10-11T17:03:00.000-04:00",
		"custom_excerpt": "We all know about Bitcoin and how it is taking the world by storm. You may not know that Bitcoin is not the only cryptocurrency and there are many others. The Wall Street Journal recently made its own cryptocurrency called WSJCoin.",
		"excerpt": "We all know about Bitcoin and how it is taking the world by storm. You may not know that Bitcoin is not the only cryptocurrency and there are many others. The Wall Street Journal recently made its own cryptocurrency called WSJCoin.",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1902",
		"title": "How creepy is your smart speaker?",
		"slug": "how-creepy-is-your-smart-speaker",
		"html": "<p>Technology has advanced far enough that we have artificial intelligence in our homes at all times. All it has is a microphone so far but soon they will use “lidar” technology. Lidar sends out waves and gets info on what’s around it based on how long it takes the wave to get back. If something is really close to a speaker, it can tell because the wave it sends out would only take a few seconds to get back.</p><p>The main question for a few years now is what the speakers and companies behind them are going to do with this data. When you ask Alexa or Siri if it is recording everything it hears, it always has a smart answer such as, “I only record when you use the wake word.”</p><p>I think these companies are recording what they hear to better market their products. That’s why sometimes when you talk about a product to family or a friend, you will get ads later about the product you were talking about.</p><p>According to the Economist, “They listen out for wake words, and then send what follows to the cloud as an audio clip; when an answer arrives, in the form of another audio clip, they play it back. Putting all the smarts in the cloud means these speakers can be very cheap and acquire new skills as their cloud-based brains are continually upgraded.” This is a good thing, after all. Getting devices smaller and more powerful is what brought us to having such advanced technology. But the main caveat is that putting everything on the cloud means that data <strong>has</strong> to be sent to Amazon or Google or Apple in order for it to work. They can be taking this data and using it to get business from you. I recently created my own personal assistant named after Iron Man’s Jarvis and every response was programmed locally on the bot: no need to access my server. However, I do understand why it’s on the cloud. For every minor change to the bot I would have to update the files on every device it’s on. For these big tech conglomerates, they would have to send an update to every device in the world and hope that these people downloaded the update.</p>",
		"feature_image": "https://images.unsplash.com/photo-1572460041714-49f1f551ad38?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T16:57:02.000-04:00",
		"updated_at": "2020-03-30T16:58:12.000-04:00",
		"published_at": "2019-06-20T16:57:00.000-04:00",
		"custom_excerpt": "Technology has advanced far enough that we have artificial intelligence in our homes at all times. All it has is a microphone so far but soon they will use “lidar” technology.",
		"excerpt": "Technology has advanced far enough that we have artificial intelligence in our homes at all times. All it has is a microphone so far but soon they will use “lidar” technology.",
		"reading_time": 2
	},
	{
		"id": "5fa4d5b1b44e1d05840c1901",
		"title": "The Corbyn Question",
		"slug": "the-corbyn-question",
		"html": "<p>Ever since Brexit, the debacle brought about by Theresa May and the Conservative Party, occurred, Jeremy Corbyn has been more loved than ever. Theresa May has been dealing with so much hate even from within her party. She was nearly ousted because of a vote of no-confidence! Even her own party didn’t have confidence in her.</p><p>So on the 4th of June, Mr. Corbyn set out to Whitehall to protest against Donald Trump’s state visit. Beside him, he had his past and future. He had banners from different parts of his journey and banners showing what he would do next. He had a flag for Stop the War, an organization he helped, and a placard for the Palestine Solidarity Campaign, another organization he helped. But the most important considering before him was his future in Downing Street.</p><p>The Labour party promises that under Corbyn’s leadership, Britain would remain stable and not be taken advantage of by big companies and businesses. Car companies such as BMW, Ford, Vauxhall, Volkswagen threaten to cut sales in the UK if they don’t get their way. Labour says that big companies will behave themselves. It also argues that Britain would lead the fight in climate change.</p><p>Although Labour has big claims, I don’t think they can all be achieved. How would he get big companies to behave themselves? If the companies decided to leave, the UK would be the one losing. And how can Labour promise that Britain would lead the fight in climate change. The US’ technology is far better than the UK’s. There is no guarantee that even the US will lead. China might even lead the fight in climate change. However, bringing an end to unilateral military action is more plausible mainly because with today’s technology, you can monitor most actions conducted by the military such as contacts, phone calls, and orders.</p>",
		"feature_image": "https://images.unsplash.com/photo-1532219362275-a1cbe9dc3602?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T16:55:13.000-04:00",
		"updated_at": "2020-04-01T14:38:25.000-04:00",
		"published_at": "2019-06-15T16:55:00.000-04:00",
		"custom_excerpt": "Ever since Brexit, the debacle brought about by Theresa May and the Conservative Party, occurred, Jeremy Corbyn has been more loved than ever. Theresa May has been dealing with so much hate even from within her party.",
		"excerpt": "Ever since Brexit, the debacle brought about by Theresa May and the Conservative Party, occurred, Jeremy Corbyn has been more loved than ever. Theresa May has been dealing with so much hate even from within her party.",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1903",
		"title": "August View Smart Doorbell",
		"slug": "august-view-smart-doorbell",
		"html": "<p>The August View smart doorbell is just about the perfect smart doorbell/surveillance system for your home. Most other smart doorbells require hardwiring for power while this one runs on battery-power. Although this does cut down on some efficiency and speed, August has found a way to harness the tech used in the majority of smart tech today and implemented it in this doorbell.</p><p>There are many things this gadget can do. You can connect it to Google Home and Apple Home so it can cooperate with <strong>other</strong> gadgets such as smart light, lamps, thermostats, cameras, and home assistants. Another one of its marvelous features is to view the camera feed. If someone rings the doorbell, you can view the feed from the camera so you know what’s coming through the door. And unlike a lot of other smart doorbells and surveillance systems, August View keeps a 24-hour backup of all its captured. The Nest Hello doorbell only has this feature with their paid plan while August View does it for free. You can also configure phone notifications for every time your doorbell rings. If you’re outside, you can view the doorbell and text the person who’s there, “Sorry! We’re not home!”</p><p>The August app is very user-friendly, and according to <a href=\"https://www.cnet.com/reviews/august-view-doorbell-camera-review/\">a review by Megan Wollerton on CNET</a>, it does a great job at guiding people through using the doorbell and its app.</p>",
		"feature_image": "https://content.fortune.com/wp-content/uploads/2019/04/august-view-e1554766136122.jpg?resize=1200,600",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T16:58:35.000-04:00",
		"updated_at": "2020-09-13T13:21:58.000-04:00",
		"published_at": "2019-04-09T16:59:00.000-04:00",
		"custom_excerpt": "The August View smart doorbell is just about the perfect smart doorbell/surveillance system for your home. Most other smart doorbells require hardwiring for power while this one runs on battery-power!",
		"excerpt": "The August View smart doorbell is just about the perfect smart doorbell/surveillance system for your home. Most other smart doorbells require hardwiring for power while this one runs on battery-power!",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1906",
		"title": "Bigger Upwards, Not Outwards",
		"slug": "bigger-upwards-not-outwards",
		"html": "<p>Over the past 30 years, fast food icons have continuously tried to lure their customers right through their corridors with mouth-watering, delectable food that keeps getting unhealthier by the hour. As prices go down, someone’s chances of developing diabetes increase.</p><p>Many food products are surging in calories, size, and sodium. As obesity rates rise, fast food companies continue to make their products more detrimental to your well-being. A few researchers at Boston University and Tufts University studied 1,787 entrées, sides and desserts at 10 chains—Arby’s, Burger King, Carl’s Jr., Dairy Queen, Hardee’s, Jack in the Box, KFC, Long John Silver’s, McDonald’s, and Wendy’s—from 1986 to 2016. The researchers found that in 2016, the average fast food dessert weighed 71 grams and had 186 calories more than in 1986, 30 years ago. One reason this might have happened is because restaurants are relying on larger desserts to increase the money customers spend on one visit.</p><p>I find this to be a very deceitful ploy by the fast food companies. Obesity rates are continuously rising as prices are decreasing because people will clearly buy products at lower prices. They <em>could</em> sell healthy food for low prices, but they proceed to give you very detrimental food. They can plant their own ingredients and save a lot of money, while keeping their food healthy. Lots of people jump at the chance to buy organic food. If this is true, lots of fast food companies can earn even more money. The gain in customers will compensate for all of the agricultural costs. This can be a possible solution. However, the majority of fast food companies apparently do not care about their customers’ health. Besides, most of them could afford agricultural costs without any increase in gains. If I were the owner of a fast food brand (for example, McDonalds), I would find a way to earn money and keep the health of my customers in good condition. I would have master businessmen on my team that would indeed find a way to accomplish this.</p>",
		"feature_image": "https://images.unsplash.com/photo-1536510233921-8e5043fce771?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T17:09:50.000-04:00",
		"updated_at": "2020-03-30T17:12:13.000-04:00",
		"published_at": "2019-03-06T17:11:00.000-05:00",
		"custom_excerpt": "Over the past 30 years, fast food icons have continuously tried to lure their customers right through their corridors with mouth-watering, delectable food that keeps getting unhealthier by the hour.",
		"excerpt": "Over the past 30 years, fast food icons have continuously tried to lure their customers right through their corridors with mouth-watering, delectable food that keeps getting unhealthier by the hour.",
		"reading_time": 1
	},
	{
		"id": "5fa4d5b1b44e1d05840c1904",
		"title": "The Man Unbroken By Solitary",
		"slug": "the-man-unbroken-by-solitary",
		"html": "<p>Albert Woodfox, the man who spent four decades in solitary confinement and was found innocent has just authored a book called “Solitary” about his life in solitary confinement and how it is the torture of the modern day. Readers of this book have said that it induces claustrophobia, and it was written to. The first four chapters explain his young life of crime, which escalated from picking pockets to armed robbery. He was willing to take anything that life did not give to him.</p><p>Once, he broke out of prison and was caught later on because he left his wallet in the cab he took to get away from the prison. When he had returned to Angola State Prison, a white prison guard named Brent Miller was killed and Albert and another man were accused, despite a great lack of evidence.</p><p>I believe the government could never repay Woodfox for all of the time he had lost in an isolated room when he was innocent. Solitary should be viewed as torture and it is indeed deplorable. The peculiar part is that the government did not give anything to him in return.</p><p>In prison, Woodfox spent his time reading legal books in hopes to find a way to get himself out. He taught other inmates how to read. He transcended the boundary between hoodlum and intellectual. I think that anyone can learn from books in prison because prisons have rather good resources. Studies show that prisoners who study have outsmarted college students in trivia, quizzes, etc.</p>",
		"feature_image": "https://images.unsplash.com/photo-1516958913532-21ddd9ab81d6?ixlib=rb-1.2.1&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=2000&fit=max&ixid=eyJhcHBfaWQiOjExNzczfQ",
		"featured": false,
		"visibility": "public",
		"created_at": "2020-03-30T17:01:12.000-04:00",
		"updated_at": "2020-04-01T14:39:06.000-04:00",
		"published_at": "2019-03-04T17:02:00.000-05:00",
		"custom_excerpt": "Albert Woodfox, the man who spent four decades in solitary confinement and was found innocent has just authored a book called “Solitary” about his life in solitary confinement and how it is the torture of the modern day.",
		"excerpt": "Albert Woodfox, the man who spent four decades in solitary confinement and was found innocent has just authored a book called “Solitary” about his life in solitary confinement and how it is the torture of the modern day.",
		"reading_time": 1
	}
]
